results/results_c5_large/results_c5_large_run2/oltp_read_write_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 74.49 qps: 1522.33 (r/w/o: 1071.51/90.38/360.44) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 80.30 qps: 1602.75 (r/w/o: 1120.73/95.50/386.51) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 79.10 qps: 1589.69 (r/w/o: 1112.40/98.50/378.80) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 80.70 qps: 1612.71 (r/w/o: 1128.80/98.20/385.70) lat (ms,95%): 694.45 err/s: 0.10 reconn/s: 0.00
[ 50s ] thds: 32 tps: 76.00 qps: 1519.50 (r/w/o: 1065.20/91.50/362.80) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 76.70 qps: 1538.29 (r/w/o: 1076.40/95.20/366.70) lat (ms,95%): 719.92 err/s: 0.10 reconn/s: 0.00
[ 70s ] thds: 32 tps: 78.70 qps: 1573.10 (r/w/o: 1101.90/95.30/375.90) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 78.10 qps: 1565.90 (r/w/o: 1096.80/94.00/375.10) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 78.50 qps: 1562.40 (r/w/o: 1091.80/96.50/374.10) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 79.90 qps: 1595.40 (r/w/o: 1116.20/100.10/379.10) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 67.00 qps: 1350.90 (r/w/o: 947.90/81.40/321.60) lat (ms,95%): 816.63 err/s: 0.10 reconn/s: 0.00
[ 120s ] thds: 32 tps: 77.20 qps: 1530.61 (r/w/o: 1070.00/95.40/365.20) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            130223
        write:                           11356
        other:                           44441
        total:                           186020
    transactions:                        9299   (77.30 per sec.)
    queries:                             186020 (1546.42 per sec.)
    ignored errors:                      3      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      77.3045
    time elapsed:                        120.2905s
    total number of events:              9299

Latency (ms):
         min:                                  120.23
         avg:                                  413.64
         max:                                 1165.35
         95th percentile:                      719.92
         sum:                              3846481.92

Threads fairness:
    events (avg/stddev):           290.5938/4.41
    execution time (avg/stddev):   120.2026/0.06